# class A:
#     ''' Document Information '''
# print(A.__doc__)
# help(A)
# यहाँ हमने 'Python' नामक एक क्लास बनाया है।
class Python:
    # यहाँ हमने __init__() मेथड को परिभाषित किया है, जो कि एक constructor है।
    def __init__(self):
        # यह लाइन एक इंस्टेंस वेरिएबल 'n' को 'Yuvraj' स्ट्रिंग के साथ इनिशियलाइज़ करती है।
        self.n = "Yuvraj"
        # यह लाइन एक इंस्टेंस वेरिएबल 'r' को 40 नंबर के साथ इनिशियलाइज़ करती है।
        self.r = 40

    # यह एक मेथड है जो कि 'Name' और 'Size' का मूल्यांकन करता है और उन्हें प्रिंट करता है।
    def m1(self):
        print("Name : ", self.n)
        print("Size : ", self.r)


# यहाँ हमने 'Python' क्लास का एक ऑब्जेक्ट 'p' बनाया है।
p = Python()
# यह लाइन 'm1()' मेथड को कॉल करती है और उसका परिणाम प्रिंट करती है।
print(p.m1())


